In [ ]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import warnings
warnings.filterwarnings('ignore')

In [5]:
df = pd.read_csv("Downloads/Indian_House_Rent_Dataset.csv")

In [6]:
print(df)

       Posted On       BHK    Size         Floor    Area Type  \
0            NaN       2.0  1100.0           NaN   Super Area
1     2022-05-13       2.0   800.0    1 out of 3   Super Area
2     2022-05-16       2.0  1000.0    1 out of 3   Super Area
3     2022-07-04       2.0   800.0    1 out of 2   Super Area
4     2022-05-09  2.0 room   850.0    1 out of 2  Carpet Area
...          ...       ...     ...           ...          ...
4741  2022-05-18       NaN  1000.0    3 out of 5  Carpet Area
4742         NaN       3.0  2000.0    1 out of 4   Super Area
4743  2022-07-10       NaN  1750.0           NaN          NaN
4744  2022-07-06       NaN  1500.0  23 out of 34  Carpet Area
4745  2022-05-04       2.0  1000.0    4 out of 5  Carpet Area

                 Area Locality               City Furnishing Status  \
0                       Bandel    India-! Kolkata       Unfurnished
1     Phool Bagan, Kankurgachi    India-! Kolkata    Semi-Furnished
2      Salt Lake City Sector 2    India-- Kolkata    Semi-Furnished
3                          NaN                NaN       Unfurnished
4                South Dum Dum    India-^ Kolkata       Unfurnished
...                        ...                ...               ...
4741              Bandam Kommu  India-< Hyderabad    Semi-Furnished
4742                       NaN  India-| Hyderabad    Semi-Furnished
4743                       NaN      %-9 Hyderabad    Semi-Furnished
4744                Gachibowli  India-{ Hyderabad    Semi-Furnished
4745           Suchitra Circle      _-9 Hyderabad               NaN

        Tenant Preferred Bathroom Point of Contact   Rent
0     Bach^elors/Fam.ily      2.0    Contact Owner  10000
1     Bachelors\/Family*      NaN              NaN  20000
2                    NaN      1.0    Contact Owner  17000
3     Bachel]ors/F@amily      1.0              NaN  10000
4            Bache[lors&      1.0    Contact Owner   7500
...                  ...      ...              ...    ...
4741  Bachelors/Fa:mily!      2.0    Contact Owner  15000
4742  B?achelors,/Family      3.0    Contact Owner  29000
4743  !Bachelors+/Family      3.0              NaN  35000
4744            $Family%      2.0    Contact Agent  45000
4745         Bachelo%rs:      2.0              NaN  15000

[4746 rows x 12 columns]

In [7]:
df.head()

,Posted On,BHK,Size,Floor,Area Type,Area Locality,City,Furnishing Status,Tenant Preferred,Bathroom,Point of Contact,Rent
0,NaN,2.0,1100.0,NaN,Super Area,Bandel,India-! Kolkata,Unfurnished,Bach^elors/Fam.ily,2.0,Contact Owner,10000
1,2022-05-13,2.0,800.0,1 out of 3,Super Area,"Phool Bagan, Kankurgachi",India-! Kolkata,Semi-Furnished,Bachelors\/Family*,NaN,NaN,20000
2,2022-05-16,2.0,1000.0,1 out of 3,Super Area,Salt Lake City Sector 2,India-- Kolkata,Semi-Furnished,NaN,1.0,Contact Owner,17000
3,2022-07-04,2.0,800.0,1 out of 2,Super Area,NaN,NaN,Unfurnished,Bachel]ors/F@amily,1.0,NaN,10000
4,2022-05-09,2.0 room,850.0,1 out of 2,Carpet Area,South Dum Dum,India-^ Kolkata,Unfurnished,Bache[lors&,1.0,Contact Owner,7500

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4746 entries, 0 to 4745
Data columns (total 12 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Posted On          4084 non-null   object
 1   BHK                3963 non-null   object
 2   Size               3826 non-null   object
 3   Floor              3960 non-null   object
 4   Area Type          3804 non-null   object
 5   Area Locality      4146 non-null   object
 6   City               4091 non-null   object
 7   Furnishing Status  4042 non-null   object
 8   Tenant Preferred   4094 non-null   object
 9   Bathroom           4205 non-null   object
 10  Point of Contact   4137 non-null   object
 11  Rent               4746 non-null   int64
dtypes: int64(1), object(11)
memory usage: 445.1+ KB

In [9]:
df.describe()

               Rent
count  4.746000e+03
mean   3.499345e+04
std    7.810641e+04
min    1.200000e+03
25%    1.000000e+04
50%    1.600000e+04
75%    3.300000e+04
max    3.500000e+06

In [10]:
df.isnull().sum()

Posted On            662
BHK                  783
Size                 920
Floor                786
Area Type            942
Area Locality        600
City                 655
Furnishing Status    704
Tenant Preferred     652
Bathroom             541
Point of Contact     609
Rent                   0
dtype: int64

In [9]:
df['BHK'].unique()

NameError: name 'df' is not defined

In [19]:
df['BHK'] = df['BHK'].str.extract(r'(\d+)')

In [16]:

df['BHK'].unique()

array(['2', '1', nan, '3', '6', '4', '5'], dtype=object)

In [8]:
df['BHK'].value_counts()

NameError: name 'df' is not defined

In [7]:
df['BHK'] = pd.to_numeric(df['BHK'])

NameError: name 'pd' is not defined

In [10]:
df['Size'].unique()

NameError: name 'df' is not defined

In [4]:
df['Size'] = df['Size'].str.extract(r'(\d+)')

NameError: name 'df' is not defined

In [5]:
df['Size'].unique()

NameError: name 'df' is not defined